//PROB8JCL  JOB  1,NOTIFY=UNTG022
//COBOL1   EXEC IGYWCLG,
//         PARM.COBOL='XREF,LIB'
//COBOL.SYSPRINT    DD    SYSOUT=*
//COBOL.SYSIN       DD    DSN=UNTG022.COBOLPGM(TSTPROB8),DISP=SHR
//GO.SYSOUT         DD    SYSOUT=*
//GO.SYSPRINT       DD    SYSOUT=*
//GO.INV8IN         DD    DSN=UNTG022.COBOLIN(INV8IN),DISP=SHR
//GO.INV8OUT        DD    DSN=UNTG022.COBOLOUT(INV8OUT),DISP=SHR